# I like Python 🐍
# Напишите программу, которая выводит на экран следующий текст:
#
# I***like***Python
#
#
# Формат входных данных
# На вход программе ничего не подаётся.
#
# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.
#
# Примечание. Используйте необязательный параметр sep.
#
# Sample Input:
#
# Sample Output:
#
# I***like***Python

print('I', 'like', 'Python', sep='***')