# Вид треугольника 📐
# Напишите программу, которая классифицирует треугольник на основе длин его сторон. Программа должна принимать три числа,
# каждое из которых представляет собой длину одной из его сторон. В результате программа должна определить, является ли
# треугольник равносторонним, равнобедренным или разносторонним.
#
#
#
# Формат входных данных
# На вход программе подаются три числа (каждое на отдельной строке) – длины сторон существующего треугольника.
#
# Формат выходных данных
# Программа должна вывести на экран текст – тип треугольника («Равносторонний», «Равнобедренный» или «Разносторонний»).

a, b, c = int(input()), int(input()), int(input())

if a == b == c:
    print('Равносторонний')
elif a == b or b == c or a == c:
    print('Равнобедренный')
else:
    print('Разносторонний')