# Напишите программу, которая выводит текст:
#
# "Python is a great language!", said Fred. "I don't ever remember having this much fun before."
#
#
# Примечание. Используйте конкатенацию строк.

print('"Python is a great language!", said Fred. "I don'+"'"+'t ever remember having this much fun before."')