# Звёздный прямоугольник
# Напишите программу, которая выводит прямоугольник, по периметру состоящий из звёздочек (*).
#
# Примечание. Высота и ширина прямоугольника равны
# 4
# 4 и
# 17
# 17 звёздочкам соответственно.
#
# Sample Input:
#
# Sample Output:
#
# *****************
# *               *
# *               *
# *****************
print('*****************')
print('*               *')
print('*               *')
print('*****************')