# Hw5_task8.py
alphabet = {
    '.-  ': 'А', '-...': 'Б', '.-- ': 'В', '--. ': 'Г',
    '-.. ': 'Д', '.   ': 'Е', '...-': 'Ж', '--..': 'З',
    '..  ': 'И', '.---': 'Й', '-.- ': 'К', '.-..': 'Л',
    '--  ': 'М', '-.  ': 'Н', '--- ': 'О', '.--.': 'П',
    '.-. ': 'Р', '... ': 'С', '-   ': 'Т', '..- ': 'У',
    '..-.': 'Ф', '....': 'Х', '-.-.': 'Ц', '---.': 'Ч',
    '----': 'Ш', '--.-': 'Щ', '-. -': 'Ъ', '-.--': 'Ы',
    '-..-': 'Ь', '. -.': 'Э', '..--': 'Ю', '.-.-': 'Я',
}
# String_In = input('Введите телеграфное сообщение вместе с помехами: ')

morze_str_in = ('-   .   .sdfs.. Dfgh-   --- .-3467- 4'
                '--- .   ... +%--- --- лоууоу-...--.-.   -.  ..  .   ')  # телеграфное сообщение с помехами
morze_clear = ''                                                         # телеграфное сообщение без помех
text_out = ''

for morze in morze_str_in:                                               # убираем помехи
    if morze == '-' or morze == '.' or morze == ' ':                     # |
        morze_clear += morze                                             # |

for index in range(0, len(morze_clear), 4):                              # дешифрация
    text_out += alphabet[morze_clear[index:index + 4]]                   # |

print(f'{text_out}')
print('%s' % text_out)
print('{}'.format(text_out))
