# Python is awesome 🐍
# Напишите программу, которая выводит текст «Python is awesome!» (без кавычек)
# 10
# 10 раз.
#
# Формат входных данных
# На вход программе ничего не подаётся.
#
# Формат выходных данных
# Программа должна вывести
# 10
# 10 раз текст «Python is awesome!» (без кавычек), каждый на отдельной строке.
for i in range(10):
    print('Python is awesome!')